// 常见的中文姓氏数组
const surnames = ["赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", ]
// 常用的用于取名的汉字数组（可根据喜好等扩充调整）
const givenNameChars = ["伟", "芳", "娜", "敏", "静", "丽", "强", "磊", "军", "洋", "勇", "杰", "婷", "涛", "华", "亮", "明", "超", "丹", "平", "飞", "龙", "云", "鹏", "慧", "雪", "玉", "艳", "佳", "俊", "文", "波", "峰", "瑞", "霞", "青", "琳", "玲", "志", "阳", "永", "远", "新", "成", "兴", "荣", "光", "宏", "昌", "春", "秋", ]

// 常见的省市区数组
const provinces = ["北京市", "天津市", "上海市",] 
const cities = {
    "北京市": ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"],
    "天津市": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "滨海新区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河区", "静海区", "蓟州区"],
    "上海市": ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区"],
};
const streets = ["中山路", "解放路", "和平路", "新华路", "文化路", "科技路", "学府路", "花园路", "朝阳路", "南京路", "北京路", "东大街", "西大街", "南大街", "北大街", "民主路", "幸福路", "光明路", "复兴路", "建国路", "长城路", "黄河大道", "长江大街",]

export { surnames, givenNameChars, provinces, cities, streets }